# -*- coding: utf-8 -*-
"""
Created on Mon Sep 28 08:03:02 2020

@author: Матосян
"""

month = {1: 'Январь', 2: 'Февраль', 3: 'Март',
         4: 'Апрель', 5: 'Май', 6: 'Июнь',
         7: 'Июль', 8: 'Август', 9: 'Сентябрь', 
         10: 'Октябрь', 11: 'Ноябрь', 12: 'Декабрь'}
season = ['зима', 'весна', 'лето', 'осень']
i = int(input('Введите порядковый номер месяца! Номер: '))
if i < 3 or i == 12: 
    z = 0
elif i > 2 and i < 6:
    z = 1
elif i > 5 and i < 9:
    z = 2
elif i > 8 and i < 12:
    z = 3
print(f'{month[i]} - сезон: {season[z]}')